# GetAllRevisionNumberingSequences Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
RevisionNumberingSequence..::..GetAllRevisionNumberingSequences Method
RevisionNumberingSequence Class See Also
---
Gets all of the revision numbering sequences from the document.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2022
# Syntax
C#
---
```text
public static ISet<ElementId> GetAllRevisionNumberingSequences(
	Document document
)
```

Visual Basic
---
```text
Public Shared Function GetAllRevisionNumberingSequences ( _
	document As Document _
) As ISet(Of ElementId)
```

Visual C++
---
```text
public:
static ISet<ElementId^>^ GetAllRevisionNumberingSequences(
	Document^ document
)
```

# ### Parameters
document
    Type: Autodesk.Revit.DB..::..Document The document that contains the sequences.
# ### Return Value
The revision numbering sequences from the document.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
RevisionNumberingSequence Class
Autodesk.Revit.DB Namespace